In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./Bank-Dataset/bank_marketing_updated_v1.csv', skiprows=[0,1])

In [3]:
df.head(5)

,customerid,age,salary,balance,marital,jobedu,targeted,default,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,response
0,1,58.0,100000,2143,married,"management,tertiary",yes,no,yes,no,unknown,5,"may, 2017",261 sec,1,-1,0,unknown,no
1,2,44.0,60000,29,single,"technician,secondary",yes,no,yes,no,unknown,5,"may, 2017",151 sec,1,-1,0,unknown,no
2,3,33.0,120000,2,married,"entrepreneur,secondary",yes,no,yes,yes,unknown,5,"may, 2017",76 sec,1,-1,0,unknown,no
3,4,47.0,20000,1506,married,"blue-collar,unknown",no,no,yes,no,unknown,5,"may, 2017",92 sec,1,-1,0,unknown,no
4,5,33.0,0,1,single,"unknown,unknown",no,no,no,no,unknown,5,"may, 2017",198 sec,1,-1,0,unknown,no

In [4]:
df.dtypes

customerid      int64
age           float64
salary          int64
balance         int64
marital        object
jobedu         object
targeted       object
default        object
housing        object
loan           object
contact        object
day             int64
month          object
duration       object
campaign        int64
pdays           int64
previous        int64
poutcome       object
response       object
dtype: object

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  45211 non-null  int64
 1   age         45191 non-null  float64
 2   salary      45211 non-null  int64
 3   balance     45211 non-null  int64
 4   marital     45211 non-null  object
 5   jobedu      45211 non-null  object
 6   targeted    45211 non-null  object
 7   default     45211 non-null  object
 8   housing     45211 non-null  object
 9   loan        45211 non-null  object
 10  contact     45211 non-null  object
 11  day         45211 non-null  int64
 12  month       45161 non-null  object
 13  duration    45211 non-null  object
 14  campaign    45211 non-null  int64
 15  pdays       45211 non-null  int64
 16  previous    45211 non-null  int64
 17  poutcome    45211 non-null  object
 18  response    45181 non-null  object
dtypes: float64(1), int64(7), object(11)
memory usage: 6.6+ MB

In [8]:
len(df[~df.age.isnull()])

45191

In [12]:
df.head()

,customerid,age,salary,balance,marital,jobedu,targeted,default,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,response
0,1,58.0,100000,2143,married,"management,tertiary",yes,no,yes,no,unknown,5,"may, 2017",261 sec,1,-1,0,unknown,no
1,2,44.0,60000,29,single,"technician,secondary",yes,no,yes,no,unknown,5,"may, 2017",151 sec,1,-1,0,unknown,no
2,3,33.0,120000,2,married,"entrepreneur,secondary",yes,no,yes,yes,unknown,5,"may, 2017",76 sec,1,-1,0,unknown,no
3,4,47.0,20000,1506,married,"blue-collar,unknown",no,no,yes,no,unknown,5,"may, 2017",92 sec,1,-1,0,unknown,no
4,5,33.0,0,1,single,"unknown,unknown",no,no,no,no,unknown,5,"may, 2017",198 sec,1,-1,0,unknown,no

In [13]:
df.month.value_counts()

may, 2017    13747
jul, 2017     6888
aug, 2017     6240
jun, 2017     5335
nov, 2017     3968
apr, 2017     2931
feb, 2017     2646
jan, 2017     1402
oct, 2017      738
sep, 2017      576
mar, 2017      476
dec, 2017      214
Name: month, dtype: int64

In [16]:
meanMonthVal = df.month.mode()[0]
meanMonthVal

'may, 2017'

In [17]:
df.month.fillna(meanMonthVal, inplace=True)

In [18]:
df.month.value_counts()

may, 2017    13797
jul, 2017     6888
aug, 2017     6240
jun, 2017     5335
nov, 2017     3968
apr, 2017     2931
feb, 2017     2646
jan, 2017     1402
oct, 2017      738
sep, 2017      576
mar, 2017      476
dec, 2017      214
Name: month, dtype: int64

In [20]:
df.pdays.value_counts().per

-1      36954
 182      167
 92       147
 183      126
 91       126
        ...
 749        1
 717        1
 589        1
 493        1
 32         1
Name: pdays, Length: 559, dtype: int64

In [7]:
df.isnull().sum()

customerid     0
age           20
salary         0
balance        0
marital        0
jobedu         0
targeted       0
default        0
housing        0
loan           0
contact        0
day            0
month         50
duration       0
campaign       0
pdays          0
previous       0
poutcome       0
response      30
dtype: int64

In [21]:
df = df[df.age.isnull() == False]
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45191 entries, 0 to 45210
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  45191 non-null  int64
 1   age         45191 non-null  float64
 2   salary      45191 non-null  int64
 3   balance     45191 non-null  int64
 4   marital     45191 non-null  object
 5   jobedu      45191 non-null  object
 6   targeted    45191 non-null  object
 7   default     45191 non-null  object
 8   housing     45191 non-null  object
 9   loan        45191 non-null  object
 10  contact     45191 non-null  object
 11  day         45191 non-null  int64
 12  month       45191 non-null  object
 13  duration    45191 non-null  object
 14  campaign    45191 non-null  int64
 15  pdays       45191 non-null  int64
 16  previous    45191 non-null  int64
 17  poutcome    45191 non-null  object
 18  response    45161 non-null  object
dtypes: float64(1), int64(7), object(11)
memory usage: 6.9+ MB

In [25]:
import numpy as np

In [27]:
df.loc[df.pdays < 0, "pdays"] = np.nan

In [28]:
df.pdays.value_counts()

182.0    167
92.0     146
183.0    126
91.0     126
181.0    116
        ...
432.0      1
25.0       1
445.0      1
579.0      1
526.0      1
Name: pdays, Length: 557, dtype: int64

In [29]:
df.pdays.describe()

count    8252.000000
mean      224.523752
std       115.202715
min         1.000000
25%       133.000000
50%       194.500000
75%       327.000000
max       871.000000
Name: pdays, dtype: float64

In [37]:
df.response.value_counts(normalize=True)

no     0.882974
yes    0.117026
Name: response, dtype: float64

In [38]:
df.response.isnull().sum()

30

In [41]:
df.shape

(45191, 19)

In [42]:
30 * 100/ 45191

0.06638489964816004

In [43]:
df.head()

,customerid,age,salary,balance,marital,jobedu,targeted,default,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,response
0,1,58.0,100000,2143,married,"management,tertiary",yes,no,yes,no,unknown,5,"may, 2017",261 sec,1,NaN,0,unknown,no
1,2,44.0,60000,29,single,"technician,secondary",yes,no,yes,no,unknown,5,"may, 2017",151 sec,1,NaN,0,unknown,no
2,3,33.0,120000,2,married,"entrepreneur,secondary",yes,no,yes,yes,unknown,5,"may, 2017",76 sec,1,NaN,0,unknown,no
3,4,47.0,20000,1506,married,"blue-collar,unknown",no,no,yes,no,unknown,5,"may, 2017",92 sec,1,NaN,0,unknown,no
4,5,33.0,0,1,single,"unknown,unknown",no,no,no,no,unknown,5,"may, 2017",198 sec,1,NaN,0,unknown,no

In [16]:
df.age.describe()

count    45191.000000
mean        40.935651
std         10.619198
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [18]:
df.age = df.age.astype('int')
df.age.mean()

40.93565090394105

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45191 entries, 0 to 45210
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  45191 non-null  int64
 1   age         45191 non-null  int64
 2   salary      45191 non-null  int64
 3   balance     45191 non-null  int64
 4   marital     45191 non-null  object
 5   jobedu      45191 non-null  object
 6   targeted    45191 non-null  object
 7   default     45191 non-null  object
 8   housing     45191 non-null  object
 9   loan        45191 non-null  object
 10  contact     45191 non-null  object
 11  day         45191 non-null  int64
 12  month       45141 non-null  object
 13  duration    45191 non-null  object
 14  campaign    45191 non-null  int64
 15  pdays       45191 non-null  int64
 16  previous    45191 non-null  int64
 17  poutcome    45191 non-null  object
 18  response    45161 non-null  object
dtypes: int64(8), object(11)
memory usage: 6.9+ MB

In [44]:
df.head()

,customerid,age,salary,balance,marital,jobedu,targeted,default,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,response
0,1,58.0,100000,2143,married,"management,tertiary",yes,no,yes,no,unknown,5,"may, 2017",261 sec,1,NaN,0,unknown,no
1,2,44.0,60000,29,single,"technician,secondary",yes,no,yes,no,unknown,5,"may, 2017",151 sec,1,NaN,0,unknown,no
2,3,33.0,120000,2,married,"entrepreneur,secondary",yes,no,yes,yes,unknown,5,"may, 2017",76 sec,1,NaN,0,unknown,no
3,4,47.0,20000,1506,married,"blue-collar,unknown",no,no,yes,no,unknown,5,"may, 2017",92 sec,1,NaN,0,unknown,no
4,5,33.0,0,1,single,"unknown,unknown",no,no,no,no,unknown,5,"may, 2017",198 sec,1,NaN,0,unknown,no

In [45]:
df.age.value_counts()

32.0    2085
31.0    1994
33.0    1972
34.0    1929
35.0    1892
        ...
93.0       2
88.0       2
95.0       2
92.0       2
94.0       1
Name: age, Length: 77, dtype: int64

In [47]:
df.age.describe()

count    45191.000000
mean        40.935651
std         10.619198
min         18.000000
25%         33.000000
50%         39.000000
75%         48.000000
max         95.000000
Name: age, dtype: float64

In [63]:
import matplotlib.pyplot as plt

In [66]:
df.age.plot.hist()
plt.show()

In [ ]:
import seaborn as sns